justinmreina/Platforms/TI/CC-Series/CC2541/Examples/SPI/ref_spi/components/ioCC2541_jmr.h
#ifndef IOCC2541_JMR_H
#define IOCC2541_JMR_H

//Bit Definitions
#define BIT0    (1<<0)
#define BIT1    (1<<1)
#define BIT2    (1<<2)
#define BIT3    (1<<3)
#define BIT4    (1<<4)
#define BIT5    (1<<5)
#define BIT6    (1<<6)
#define BIT7    (1<<7)
#define BIT8    (1<<8)
#define BIT9    (1<<90)
#define BITA    (1<<10)
#define BITB    (1<<11)
#define BITC    (1<<12)
#define BITD    (1<<13)
#define BITE    (1<<14)
#define BITF    (1<<15)


//Misc. Macros from ioCC2541.h
#define SFR(name,addr)   (0)
#define SFRBIT(name, addr, bit7, bit6, bit5, bit4, bit3, bit2, bit1, bit0) 		(0)

#define SBIT(name,addr)  (0)
#define XREG(addr)       (0)
#define PXREG(addr)      (0)
#define VECT(num,addr)   (0)

#define  RFERR_VECTOR   (0)
#define  ADC_VECTOR     (0)
#define  URX0_VECTOR    (0)
#define  URX1_VECTOR    (0)
#define  ENC_VECTOR     (0)
#define  ST_VECTOR      (0)
#define  P2INT_VECTOR   (0)
#define  UTX0_VECTOR    (0)
#define  DMA_VECTOR     (0)
#define  T1_VECTOR      (0)
#define  T2_VECTOR      (0)
#define  T3_VECTOR      (0)
#define  T4_VECTOR      (0)
#define  P0INT_VECTOR   (0)
#define  UTX1_VECTOR    (0)
#define  P1INT_VECTOR   (0)
#define  RF_VECTOR      (0)
#define  WDT_VECTOR     (0)

#define  I2C_VECTOR     (0)

//Registers from ioCC2541.h "SFR()"
#define  P0      	0x80
#define  P0_7    	0x80
#define  P0_6    	0x80
#define  P0_5    	0x80
#define  P0_4    	0x80
#define  P0_3    	0x80
#define  P0_2    	0x80
#define  P0_1    	0x80
#define  P0_0    	0x80
#define  SP        	0x81
#define  DPL0      	0x82
#define  DPH0      	0x83
#define  DPL1      	0x84
#define  DPH1      	0x85
#define  U0CSR     	0x86
#define  PCON      	0x87
#define  TCON    	0x88
#define  URX1IF    	0x88
#define  ADCIF    	0x88
#define  URX0IF    	0x88
#define  IT1    	0x88
#define  RFERRIF    0x88
#define  IT0    	0x88
#define  P0IFG     	0x89
#define  P1IFG     	0x8A
#define  P2IFG     	0x8B
#define  PICTL     	0x8C
#define  P1IEN     	0x8D
#define  P0INP     	0x8F
#define  SFRBIT( P1	0x90
#define  P1_7		0x90
#define  P1_6		0x90
#define  P1_5		0x90
#define  P1_4		0x90
#define  P1_3		0x90
#define  P1_2		0x90
#define  P1_1		0x90
#define  P1_0		0x90
#define  RFIRQF1   	0x91
#define  DPS       	0x92
#define  MPAGE     	0x93
#define  T2CTRL    	0x94
#define  ST0       	0x95
#define  ST1       	0x96
#define  ST2       	0x97
#define  IEN2      	0x9A
#define  S1CON     	0x9B
#define  T2CSPCFG  	0x9C
#define  T2EVTCFG  	0x9C
#define  SLEEPSTA  	0x9D
#define  CLKCONSTA 	0x9E
#define  FMAP      	0x9F
#define  P2        	0xA0
#define  P2_7		0xA0
#define  P2_6		0xA0
#define  P2_5		0xA0
#define  P2_4		0xA0
#define  P2_3		0xA0
#define  P2_2		0xA0
#define  P2_1		0xA0
#define  P2_0		0xA0
#define  T2IRQF    	0xA1
#define  T2M0      	0xA2
#define  T2M1      	0xA3
#define  T2MOVF0   	0xA4
#define  T2MOVF1   	0xA5
#define  T2MOVF2   	0xA6
#define  T2IRQM    	0xA7
#define  IP0       	0xA9
#define  _SFRAA    	0xAA
#define  P0IEN     	0xAB
#define  P2IEN     	0xAC
#define  STLOAD    	0xAD
#define  PMUX      	0xAE
#define  T1STAT    	0xAF
#define  ENCDI     	0xB1
#define  ENCDO     	0xB2
#define  ENCCS     	0xB3
#define  ADCCON1   	0xB4
#define  ADCCON2   	0xB5
#define  ADCCON3   	0xB6
#define  IP1       	0xB9
#define  ADCL      	0xBA
#define  ADCH      	0xBB
#define  RNDL      	0xBC
#define  RNDH      	0xBD
#define  SLEEPCMD  	0xBE
#define  RFERRF    	0xBF
#define  IRCON   	0xC0
#define  STIF		0xC0
#define  P0IF		0xC0
#define  T4IF		0xC0
#define  T3IF		0xC0
#define  T2IF		0xC0
#define  T1IF		0xC0
#define  DMAIF		0xC0
#define  U0DBUF    	0xC1
#define  U0BAUD    	0xC2
#define  T2MSEL    	0xC3
#define  U0UCR     	0xC4
#define  U0GCR     	0xC5
#define  CLKCONCMD 	0xC6
#define  MEMCTR    	0xC7
#define  WDCTL     	0xC9
#define  T3CNT     	0xCA
#define  T3CTL     	0xCB
#define  T3CCTL0   	0xCC
#define  T3CC0     	0xCD
#define  T3CCTL1   	0xCE
#define  T3CC1     	0xCF
#define  PSW     	0xD0
#define  CY			0xD0
#define  AC			0xD0
#define  F0			0xD0
#define  RS1		0xD0
#define  RS0		0xD0
#define  OV			0xD0
#define  F1			0xD0
#define  P			0xD0
#define  DMAIRQ    	0xD1
#define  DMA1CFGL  	0xD2
#define  DMA1CFGH  	0xD3
#define  DMA0CFGL  	0xD4
#define  DMA0CFGH  	0xD5
#define  DMAARM    	0xD6
#define  DMAREQ    	0xD7
#define  TIMIF   	0xD8
#define  TIMIF7		0xD8
#define  T1OVFIM	0xD8
#define  T4CH1IF	0xD8
#define  T4CH0IF	0xD8
#define  T4OVFIF	0xD8
#define  T3CH1IF	0xD8
#define  T3CH0IF	0xD8
#define  T3OVFIF	0xD8
#define  RFD       	0xD9
#define  T1CC0L    	0xDA
#define  T1CC0H    	0xDB
#define  T1CC1L    	0xDC
#define  T1CC1H    	0xDD
#define  T1CC2L    	0xDE
#define  T1CC2H    	0xDF
#define  ACC       	0xE0
#define  RFST      	0xE1
#define  T1CNTL    	0xE2
#define  T1CNTH    	0xE3
#define  T1CTL     	0xE4
#define  T1CCTL0   	0xE5
#define  T1CCTL1   	0xE6
#define  T1CCTL2   	0xE7
#define  IRCON2 	0xE8
#define  WDTIF		0xE8
#define  P1IF		0xE8
#define  UTX1IF		0xE8
#define  UTX0IF		0xE8
#define  P2IF		0xE8
#define  RFIRQF0   	0xE9
#define  T4CNT     	0xEA
#define  T4CTL     	0xEB
#define  T4CCTL0   	0xEC
#define  T4CC0     	0xED
#define  T4CCTL1   	0xEE
#define  T4CC1     	0xEF
#define  B         	0xF0
#define  PERCFG    	0xF1
#define  ADCCFG    	0xF2
#define  APCFG     	0xF2
#define  P0SEL     	0xF3
#define  P1SEL     	0xF4
#define  P2SEL     	0xF5
#define  P1INP     	0xF6
#define  P2INP     	0xF7
#define  U1CSR   	0xF8
#define  U1MODE		0xF8
#define  U1RE		0xF8
#define  U1SLAVE	0xF8
#define  U1FE		0xF8
#define  U1ERR		0xF8
#define  U1RX_BYTE	0xF8
#define  U1TX_BYTE	0xF8
#define  U1ACTIVE	0xF8
#define  U1DBUF    	0xF9
#define  U1BAUD    	0xFA
#define  U1UCR     	0xFB
#define  U1GCR     	0xFC
#define  P0DIR     	0xFD
#define  P1DIR     	0xFE
#define  P2DIR     	0xFF

#endif /* IOCC2541_JMR_H */

